import streamlit as st

st.set_page_config(page_title="Solar Platform", page_icon="☀️", layout="centered")

st.title("☀️ Արևային Էներգիայի Խելացի Պլատֆորմ")
st.markdown("""
Բարի գալուստ արևային էներգետիկայի ավտոմատացված կառավարման և նախագծման հարթակ: 
Խնդրում ենք ձախակողմյան մենյուից ընտրել անհրաժեշտ մոդուլը.

* 📈 **ML Pipeline (Օպերատիվ Կառավարում):** Նախատեսված է գործող կայանների առաջիկա 7 օրվա հզորությունը Արհեստական Ինտելեկտով գուշակելու և մոդելները վերապատրաստելու համար։
* 🏗️ **PV Simulator (Նախագծային Պլանավորում):** Նախատեսված է նոր կառուցվող կայանների համար։ Կիրառելով մաքուր աստղագիտություն և ֆիզիկա (`pvlib`)՝ հաշվարկում է կայանի տարեկան (8760 ժամվա) արտադրողականությունը՝ հաշվի առնելով թեքությունը, ստվերները և կորուստները։
""")